//
// Flag.cs
//


using UnityEngine;


// ------------------------------------------------------------------
// フラグクラス
// ------------------------------------------------------------------
public class Flag
{

    // フラグ用変数
    private byte m_flag = 0x00;


    // --------------------------------------------
    // フラグのチェック
    // flag: 調べたいフラグ
    // --------------------------------------------
    public bool Check(byte flag)
    {
        return ((m_flag & flag) != 0x00)? true:false;
    }

    // --------------------------------------------
    // フラグをオンにする
    // flag: オンにしたいフラグ
    // --------------------------------------------
    public void On(byte flag)
    {
        m_flag |= flag;
    }

    // --------------------------------------------
    // フラグのオフ
    // flag: オフにしたいフラグ
    // --------------------------------------------
    public void Off(byte flag)
    {
        m_flag &= (byte)~flag;
    }
}
